{"pageProps":{"post":{"title":"Launching Rentaflop","date":"2022-10-26T","slug":"launching-rentaflop","content":"<h1 id=\"user-content-launching-rentaflop\">Launching Rentaflop</h1>\n<p><em>October 26, 2022</em></p>\n<p>If you're a rentaflop beta tester or early user, you may have noticed something different about rentaflop today: the \"beta\" flair at the top-left screen\nis gone!</p>\n<h2 id=\"user-content-announcing-rentaflops-official-launch\">Announcing Rentaflop's Official Launch</h2>\n<p>Today we're excited to announce we've concluded our beta and have officially launched to the public! If you've been using rentaflop to render your projects, thank\nyou for being an early user. Your feedback has helped us shape the direction of our product. If you're new to rentaflop, welcome! We take delight in making our\nusers happy and want to ensure you have a great experience, so feel free to <a href=\"https://portal.rentaflop.com/contact\" target=\"_blank\" rel=\"nofollow noopener noreferrer\">reach out</a> with questions and feedback.</p>\n<h2 id=\"user-content-whats-new\">What's New?</h2>\n<p>Here are the major changes we've made to rentaflop in the last month, and why they matter to you:</p>\n<ol>\n<li>1. <strong>Price calculator</strong>, allowing you to see exactly what you'll pay for a render and view sample frames to verify render correctness.</li>\n<li>2. <strong>Blender versioned rendering</strong>, so you can choose from among several different Blender versions to render your project with.</li>\n<li>3. <strong>File upload size limit raised to 1 GB</strong>, so you can now upload much larger projects than before.</li>\n<li>4. <strong>Encrypted .blend files</strong>, giving you enhanced data privacy and protecting your IP during the rendering process.</li>\n</ol>\n<h2 id=\"user-content-whats-next\">What's Next?</h2>\n<p>The following features are on our near-term roadmap and are coming soon:</p>\n<ol>\n<li>1. <strong>A render time estimate</strong>, so you'll know when your project's rendering will be complete.</li>\n<li>2. <strong>Support for Blender scripting</strong>, to allow for better automation during rendering.</li>\n<li>3. <strong>Support for .zip files</strong> for when it's not practical to pack everything in one .blend file.</li>\n<li>4. <strong>Notification system</strong> to email you when your project's rendering is complete.</li>\n</ol>\n<p>We hope you continue to make us a part of your creative workflow and find us useful in creating your best Blender works!</p>\n","ogImage":{"url":"static/rocket_graphic.avif"},"coverImage":"/static/rocket_graphic.avif","excerpt":"We're excited to announce we've concluded our beta and have officially launched to the public!"}},"__N_SSG":true}