{"pageProps":{"post":{"title":"Becoming a Rentaflop Host","date":"2022-04-28T","slug":"hosting","content":"<h1>Becoming a Rentaflop Host</h1>\n<p><em>April 28, 2022 (updated February 17, 2023)</em></p>\n<p>Members of our global network of hardware owners are called hosts. In this post, we'll describe how you can add your graphics cards to our crowdsourced\ncloud rendering network and earn money without lifting a finger.</p>\n<p>Do you want to continue mining Ethereum, even though it's now proof of stake? Did you know GPU rendering is worth 10-100x as much as crypto mining?\nRead on to learn how to double your mining rig's crypto earnings, even though Ethereum is PoS, and put your hardware to work helping people.\nIf you want a quickstart, please skip to the System Requirements section.</p>\n<h2>Why We're Different</h2>\n<p>Rentaflop miner is different from most cryptocurrency mining software because it's often not even mining cryptocurrency. When you run rentaflop miner,\nyour hardware solves computational tasks to help others create projects in 3D animation. When no tasks are available,\nyour hardware mines cryptocurrency to ensure it's always earning you the most. As a result, we're really\ntwo miners wrapped into one: a traditional crypto miner that mines cryptocurrency directly, and a special task miner that securely runs our users'\ncomputing tasks. The task miner runs whenever a user submits a task, such as 3D rendering jobs, on our website.\nThe task is then broken up and run in parallel across our network, composed of all the computers running rentaflop miner. This means your hardware\nis doing useful work to help people while always maximizing your crypto payout. We use <a href=\"https://trex-miner.com/\">t-rex miner</a> for the traditional miner, which runs\nin the downtime when no rendering tasks are available.</p>\n<h2>Payouts</h2>\n<p>Let's talk about your money. There are two types of payouts on rentaflop miner, one for each of the two types of mining we do. This means you get paid separately for the\ntraditional and task miner. Rentaflop miner is free to use. For the traditional miner, we take no fee and you get paid directly from the mining pool of your choice. For the task miner, we're paid\nby our rendering customers in USD, convert the payments to crypto, then pay you that crypto as a bonus (on top of what you automatically get from the traditional miner)\nwhen you meet our threshold requirements (.1 ETH or .01 BTC paid every Monday at 12PM ET). The amount earned per hour from the task miner will typically be larger than that of the traditional miner\nsince your hardware is performing high-value work. However, you may initially find task miner payouts to be smaller than traditional payouts\nbecause we're still growing and won't always have tasks for your hardware to process. In the event the bonus is 0, rentaflop miner will\nbehave like a traditional crypto miner and you'll receive a payout comparable to that of other miners.</p>\n<p>For the task miner, you may choose to be paid in Ethereum (ETH), even post-merge, or Bitcoin (BTC). For the traditional miner, you may select any crypto currency\nand also configure the hashing algorithm, pool you'd like to mine to, etc., as long as they're compatible with t-rex miner. Instructions for configuration are found\nin the Setting Up Rentaflop Miner on HiveOS section.</p>\n<h2>System Requirements</h2>\n<p>There are only a few hard requirements for running rentaflop miner.\nHere are the minimum basic system requirements:</p>\n<ol>\n<li>1. A discrete Nvidia graphics card from the last several years (10, 20, or 30 series)</li>\n<li>2. About 8GB free storage</li>\n<li>3. HiveOS</li>\n</ol>\n<p>If you're not currently running HiveOS, we recommend getting a reliable\n16+GB flash drive with at least 100MB/s write speed (typically under $10) and following the GPU instructions <a href=\"https://hiveon.com/install/\">here</a> to create a bootable USB. We like this route because\nit allows you to separate mining from personal business. You can boot the USB when you want to mine and boot your other drive when you want\nto do gaming or use your graphics card(s) otherwise.\nWe currently support all Nvidia 40, 30, 20, and most 10 series (1060 and above) GPUs.</p>\n<h2>Setting Up Rentaflop Miner on HiveOS</h2>\n<p>To set up rentaflop miner on HiveOS, you'll need to add rentaflop as a trusted user to your farm as well as email us your wallet address.</p>\n<p>Adding Rentaflop as a trusted user allows rentaflop to configure your machine to run our miner, and it enables us to fix any bugs that could arise in the future.\nYou can add us by going to <a href=\"https://the.hiveos.farm\">https://the.hiveos.farm</a> and selecting your farm, then clicking \"access\" and \"trust user\".\nNext, give \"support@rentaflop.com\" access level \"advanced\" and select \"user must have 2FA enabled\".</p>\n<p>We use Coinbase to conduct payouts, so if you want to maximize your earnings and reduce transaction costs make sure to use a Coinbase wallet address\nfor the following step and opt in to \"instant sends\"\n<a href=\"https://www.coinbase.com/settings/privacy-rights\">here</a>. If you decide against this, then a small transaction fee we must pay to Coinbase will slightly reduce your\npayout amounts.</p>\n<p>To complete the set up, email us at <a href=\"mailto:support@rentaflop.com\">support@rentaflop.com</a> with the following information:</p>\n<ol>\n<li>1. Email address we can reach you at for important communications</li>\n<li>2. Wallet address for the task miner (BTC or ETH)</li>\n<li>3. Indicate whether or not you'd also like to run the optional traditional crypto miner (t-rex) in the downtime when no render tasks are available</li>\n</ol>\n<p>If you answered \"no\" to running the traditional crypto miner, no additional information is needed. If \"yes\", please also provide the following, ensuring it's\ncompatible with t-rex miner as well as the wallet address (--user) you've configured:</p>\n<ol>\n<li>4. Configuration parameters you'd like to pass to t-rex miner. You may specify any of the t-rex configuration options found <a href=\"https://github.com/trexminer/T-Rex\">here</a> (and if you're unsure, then we can get you started with some good defaults).\nNotably, you may select a separate currency/wallet to use for t-rex than the one you specified above for the rentaflop task miner payouts. To do so, set the --user\nparameter. Here's an example that sets the --user parameter to use an ETC wallet (for t-rex traditional crypto mining)\nand configures an optional rig name and network timout limit:</li>\n</ol>\n<pre><code>--user 0x813B628699bd918dB85542D7259c40DA6DD6554D -w rentaflop_rig1 --timeout 300\n</code></pre>\n<ol>\n<li>5. Desired hash algorithm</li>\n<li>6. Pool URL</li>\n</ol>\n<p>After completing these steps, we'll configure rentaflop miner for you and notify you when the set up is complete. If you run into issues with the above instructions\nor have questions, please reach out to <a href=\"mailto:support@rentaflop.com\">support@rentaflop.com</a>, and we'll help you get running.</p>\n<p>Note: you may make changes, such as using a different email or wallet address, to your configuration at any time. You will be paid your bonus payout in\nwhichever cryptocurrency corresponds to the wallet address you have set at the time the payout is calculated.</p>\n<p>We hope you enjoy running rentaflop miner and get satisfaction from earning extra crypto while helping 3D animation artists. Happy mining!</p>\n<h2>Miner Status Dashboard</h2>\n<p>To see information on your devices running rentaflop miner, please visit the <a href=\"https://portal.rentaflop.com/miner\">miner dashboard</a> page and enter your wallet address.\nThe dashboard is still in beta, and we're adding more soon.</p>\n<h2>Recommendations</h2>\n<p>We provide some recommendations to improve your hardware's profitability. These are in addition to anything, such as overclocking, you might already do to improve your\nhash rate for a traditional crypto miner. In general, whatever you do to increase the rate at which your rig can complete rendering tasks will also\ntend to increase your bonus payout.</p>\n<ol>\n<li>2 CPU threads per GPU. The GPU does most of the work, but having enough CPU for data transfer/processing sometimes helps.</li>\n<li>8GB RAM.</li>\n<li>Storage with fast read and write speeds.</li>\n<li>10 Mbps Internet bandwidth per GPU. This number shrinks as the number of GPUs grows and usually isn't a problem, but it's possible for bandwidth to be a bottleneck when your rig receives many tasks simultaneously.</li>\n<li>16X PCIE connection for GPUs. 1X connection works fine, but if you can manage 16X you'll avoid occasional data transfer slowdowns.</li>\n</ol>\n<h2>Questions and Troubleshooting</h2>\n<p>What are your questions? How can we help you get started with rentaflop miner? Please reach out to <a href=\"mailto:support@rentaflop.com\">support@rentaflop.com</a>.</p>\n","ogImage":{"url":"/static/crypto_rig.jpg"},"coverImage":"/static/crypto_rig.jpg","excerpt":"Instructions for how you can add your graphics cards to our crowdsourced cloud rendering network and earn money without lifting a finger."}},"__N_SSG":true}