{"pageProps":{"post":{"title":"Rentaflop Mission Statement","date":"2022-02-14T","slug":"mission-statement","content":"<h1 id=\"user-content-rentaflop-mission-statement\">Rentaflop Mission Statement</h1>\n<p><em>February 14, 2022</em></p>\n<p>We're married to our work at rentaflop. As such, Valentine's Day is perfect for describing\njust what our work means to us in the form of a mission statement blog post. It's a labor of love.</p>\n<h2 id=\"user-content-rentaflops-mission-is-to-increase-the-computational-wealth-of-the-world\">Rentaflop’s mission is to increase the computational wealth of the world</h2>\n<p>We believe that:</p>\n<ol>\n<li>1. Access to powerful computation is a necessity of modern life.</li>\n<li>2. Substantial computing power should be at the disposal of everyone on Earth.</li>\n<li>3. The development of AI is the most important thing happening in the world.</li>\n<li>4. Lowering the cost curve for AI is imperative.</li>\n<li>5. Hardware owners should be able to rent out cycles on their devices while not otherwise in use.</li>\n<li>6. Putting underutilized computers to work is a great human benefit.</li>\n<li>7. A platform leveraging dormant computers and empowering anyone to command computation at great scale will accomplish points 1-6, increasing the computational wealth\nof the world.</li>\n</ol>\n<p>Let's elaborate each of these points.</p>\n<h3 id=\"user-content-access-to-powerful-computation-is-a-necessity-of-modern-life\"><strong>Access to powerful computation is a necessity of modern life</strong></h3>\n<p>Modern computers enable a multitude of things that weren't possible just a couple decades ago. In the year 2000, for instance, you couldn't ask your phone\nto make an <a href=\"https://ai.googleblog.com/2018/05/duplex-ai-system-for-natural-conversation.html\" target=\"_blank\" rel=\"nofollow noopener noreferrer\">automated restaurant reservation</a>. Many features of smart phones,\nhome assistants, and apps the world uses every day are fairly recent developments. What enables these modern computers to enable our new lives?</p>\n<p>To some extent, it's better software. New frameworks and libraries facilitated development on web, mobile, etc. immensely over the past two decades. For example,\ntools like React and Swift have made it much easier to do things almost unimaginable in UI development twenty years ago. Better software algorithms have also paved\nthe way for improvements in technologies like Natural Language Processing (as seen in Google Duplex and Siri/Alexa) and Computer Vision (vital when your Tesla needs to\navoid that semitruck). Companies employ recently-improved AI algorithms in many common scenarios in which users often aren't aware. Consider that you may be providing\ndata labels to TikTok or <a href=\"https://research.netflix.com/research-area/recommendations\" target=\"_blank\" rel=\"nofollow noopener noreferrer\">Netflix's recommendation system</a> each time you like or even just watch a video.\nDo Netflix and other big tech companies know you better than you know you?</p>\n<p>Yet, perhaps to a greater extent, better hardware is the cause. Many of the basic ideas behind the most popular AI algorithms today, such as Deep Learning, had already been in\nexistence for decades by the turn of the millennium. It appears to be comparatively easier to develop good algorithms than it is to make good hardware. In fact,\ncomputer pioneers in the 1950s and 60s often thought up <a href=\"https://en.wikipedia.org/wiki/Matchbox_Educable_Noughts_and_Crosses_Engine\" target=\"_blank\" rel=\"nofollow noopener noreferrer\">interesting algorithms</a>\nwhile lacking proper computer resources to fully test them. Clearly, software advancements aren't the primary driver of modern life; if that were the case, AI would've\nbeen <a href=\"https://web.eecs.umich.edu/~kuipers/opinions/AI-progress.html\" target=\"_blank\" rel=\"nofollow noopener noreferrer\">solved in the 70s</a>. What's changed since then? The computer you're reading this post on is orders of magnitude more powerful\nthan the former state of the art <a href=\"https://en.wikipedia.org/wiki/Apollo_Guidance_Computer\" target=\"_blank\" rel=\"nofollow noopener noreferrer\">Apollo Guidance Computer</a> that took humanity to the moon. Deep Learning\npractitioners are keenly aware of the necessity of hardware improvements, as better hardware greatly multiplied the importance and usefulness of DL in recent years.\nThe ability to scale up to larger models and datasets, the direct result of hardware advancement, made great strides in DL performance possible.\nAccess to better hardware, and by extension better computation, drives the way we interact with computers and, thus, modern life.</p>\n<h3 id=\"user-content-substantial-computing-power-should-be-at-the-disposal-of-everyone-on-earth\"><strong>Substantial computing power should be at the disposal of everyone on Earth</strong></h3>\n<p>Intelligence and talent are not qualities limited to the United States and other first-world countries. Gifted people emerge from all corners of the globe, and their\ncontributions to humanity are too often lost due to lack of resources and opportunity. Imagine selecting the greatest genius from a random sample of 1 million people. <a href=\"https://en.wikipedia.org/wiki/Srinivasa_Ramanujan\" target=\"_blank\" rel=\"nofollow noopener noreferrer\">How smart would he or she be?</a> Now imagine taking 3 thousand\nsuch people and never letting them use the Internet. What would be the loss to human advancement? Yet this is roughly what's happening today, as about\n3 billion people in the world have never used the Internet (the true loss is that you're reading this blog instead of theirs 😊). Luckily, that's likely to change in\nthe coming years as Internet technology spreads, but there will still be a great need for substantial computing power throughout the world.\nJust as everyone should have food, water, or any other necessity, everyone should have computation.</p>\n<h3 id=\"user-content-the-development-of-ai-is-the-most-important-thing-happening-in-the-world\"><strong>The development of AI is the most important thing happening in the world</strong></h3>\n<p>OK, this one's clearly an opinion, but I think it's a good one. We've seen several examples of how AI is driving modern innovation. Now\nthink about the future. What will AI be able to do?</p>\n<p>Perhaps a better question is: What will AI not be able to do? There aren't many things I can confidently say AI won't be able to do. Most of these things come up against\nthe boundaries set by the laws of physics, such as \"design a spacecraft to travel from Earth to Mars in 1 second.\" But what about everything else, including\nevery problem humanity faces today? I tend to think they're all solvable by The Future. Certain things might be 100+ years down the road, like the ability to\n<a href=\"https://academic.oup.com/mind/article/LIX/236/433/986238\" target=\"_blank\" rel=\"nofollow noopener noreferrer\">imitate humans well</a>, but they're still probably achievable eventually. It's conceivable that one day\nAI will be able to do anything a human can do–including thinking, and at 1000x speed. While we'll need to be careful with how we handle this technology (or how it\nhandles us), it has great potential to improve the world, and what's more important than that?</p>\n<h3 id=\"user-content-lowering-the-cost-curve-for-ai-is-imperative\"><strong>Lowering the cost curve for AI is imperative</strong></h3>\n<p>When we consider the enormous benefits of future AI, coupled with the scarcity of AI resources in the world, the need to lower the cost of AI\nbecomes apparent. In our experience, the two greatest barriers to doing serious AI are the necessary skills and the cost. Few people have the ability to write code,\nnor do many possess the mathematical foundations necessary to understand, create, and experiment with AI models. To do AI well generally requires both skills, yet\nthe intersection of people with both skillsets is exceedingly small. Furthermore, existing hardware solutions for training AI models are prohibitively expensive for\nmany. Building a GPU-powered AI computer costs thousands of dollars and often involves camping overnight at Best Buy. Using a cloud provider service like AWS may cost hundreds\nor more per model. Worse, the cost issue exacerbates the skills problem by reducing the amount of time people spend training and tweaking their models, a valuable learning\nexperience. If we believe AI drives innovation, then we must promote its practice by making it affordable.</p>\n<h3 id=\"user-content-hardware-owners-should-be-able-to-rent-out-cycles-on-their-devices-while-not-otherwise-in-use\"><strong>Hardware owners should be able to rent out cycles on their devices while not otherwise in use</strong></h3>\n<p>Suppose you're someone fortunate enough to own a computer with a dedicated GPU. That often means you're a gamer, AI practitioner, or cryptocurrency miner.\nIf you're a gamer or AI practitioner, then you'll likely only be utilizing your hardware a small percentage of the time. This means a\nsignificant portion of compute cycles on your machine go to waste. Why not let someone else use your computer while you're not? Assuming it's secure, remotely\nrenting out GPUs to perform high-value compute jobs would be extremely lucrative for gamers and AI practitioners. After all,\nthe rentals occur only when the device is otherwise unused, so any rental payment is almost entirely profit, minus electricity costs.</p>\n<p>If you're a cryptocurrency miner, then you've already found a way to earn passive income from your computer while you’re not using it. This means almost no compute\ncycles go unused. But could they sometimes be put to better use? If you believe in helping others, driving innovation, and furthering humanity, then the answer is yes.\nOr, if you just want to earn more crypto without having to lift a finger, then the answer is also yes.</p>\n<h3 id=\"user-content-putting-underutilized-computers-to-work-is-a-great-human-benefit\"><strong>Putting underutilized computers to work is a great human benefit</strong></h3>\n<p>Who cares about GPUs, anyways? Well, even if you don't own, don't care, don't know, and don't want to know GPUs, the same principle in point 5 for GPUs holds for most\nother types of computers. Imagine earning an extra couple hundred bucks a year just from downloading an app on your iPhone. Not only do you benefit from the payments,\nbut you also help others by allowing your phone to solve math problems for them while you sleep. Now imagine a network of computers, phones, devices, etc. that helps\nmillions earn extra money and many thousands to perform powerful calculations they otherwise couldn't afford. On a global scale, that's a great benefit to humanity.</p>\n<h3 id=\"user-content-a-platform-leveraging-dormant-computers-and-empowering-anyone-to-command-computation-at-great-scale-will-accomplish-points-1-6-increasing-the-computational-wealth-of-the-world\"><strong>A platform leveraging dormant computers and empowering anyone to command computation at great scale will accomplish points 1-6, increasing the computational wealth of the world</strong></h3>\n<p>Points 1-6 raise two interesting and important problems in the world today: 1) Many don't have the computational resources to partake in human technological\nadvancement and 2) Many computational resources are perpetually underutilized. A platform implementing a widely-used solution for people with problem #2 to help\nthose with problem #1 and vice versa will simultaneously solve both problems. Efficiently matching these two types of people will, by augmenting the value humanity\nderives from computation, increase the computational wealth of the world.</p>\n","ogImage":{"url":"/static/rentaflop_logo.png"},"coverImage":"/static/rentaflop_logo.png","excerpt":"Rentaflop’s mission is to increase the computational wealth of the world."}},"__N_SSG":true}